Repository: nicholas-ross/SSMS-Schema-Folders
Catalog: Resources/Resources.*.resx
Languages: de

# PropertyCategorySchemaFolderOptionsActive
source: Active
de: Aktivieren

# PropertyCategorySchemaFolderOptionsFolderDisplayOptions
source: Folder Display Options
de: Anzeigeoptionen für Ordner

# PropertyCategorySchemaFolderOptionsFolderLevel1
source: Folder Level 1
de: Ordnerebene 1

# PropertyCategorySchemaFolderOptionsFolderLevel2
source: Folder Level 2
de: Ordnerebene 2

# PropertyCategorySchemaFolderOptionsObjectDisplayOptions
source: Object Display Options
de: Anzeigeoptionen für Objekte

# PropertyCategorySchemaFolderOptionsPerformance
source: Performance
de: Leistung

# PropertyDescriptionSchemaFolderOptionsAppendDot
source: Add a dot after the schema name on the folder label.
de: Fügt einen Punkt nach dem Schema für den Namen des Ordners an.

# PropertyDescriptionSchemaFolderOptionsCloneParentNode
source: Add the right click and connection properties of the parent node to the schema folder node.
de: Erzeugt den Ordnerknoten anhand des übergeordneten Knotens als Vorlage. Die Eigenschaften des übergeordneten Knotens (z.B. Kontextmenü) wird übernommen.

# PropertyDescriptionSchemaFolderOptionsEnabled
source: Group sql objects in Object Explorer (tables, views, etc.) into schema folders.
de: Aktiviert das Gruppieren von SQL Objekten (Tabellen, Views, etc.) in Ordner mit dem Namen des Schemas im Objekt Explorer.

# PropertyDescriptionSchemaFolderOptionsLevel1FolderType
source: The type of sorting to use to create the folders.
de: Die Art der Sortierung, die zum Erstellen der Ordner verwendet werden soll.

# PropertyDescriptionSchemaFolderOptionsLevel1MinNodeCount
source: Sort nodes into folders only when it contains at least this many nodes.
de: Sortieren Sie Knoten nur dann in Ordner, wenn sie mindestens so viele Knoten enthalten.

# PropertyDescriptionSchemaFolderOptionsLevel1Regex
source: The regex pattern to use for grouping. Only used if Folder Type is Regex. For example (?:^(?:tbl_|AAA_sp_|sp_)([^_]+)_[^_].*|^(?!tbl_|AAA_sp_|sp_)([^_]+)_[^_]+_.*)
de: Das für die Gruppierung zu verwendende Regex-Muster. Wird nur verwendet, wenn Ordnertyp Regex ist.

# PropertyDescriptionSchemaFolderOptionsLevel1GroupNonMatchingAsOther
source: Group items that do not match the regex into a folder named 'Other'. Only used if Folder Type is Regex.
de: Gruppieren Sie Elemente, die nicht mit dem Regex übereinstimmen, in einem Ordner namens "Andere". Wird nur verwendet, wenn Ordnertyp Regex ist.

# PropertyDescriptionSchemaFolderOptionsLevel2FolderType
source: The type of sorting to use to create the folders.
de: Die Art der Sortierung, die zum Erstellen der Ordner verwendet werden soll.

# PropertyDescriptionSchemaFolderOptionsLevel2MinNodeCount
source: Sort nodes into folders only when it contains at least this many nodes.
de: Sortieren Sie Knoten nur dann in Ordner, wenn sie mindestens so viele Knoten enthalten.

# PropertyDescriptionSchemaFolderOptionsLevel2Regex
source: The regex pattern to use for grouping. Only used if Folder Type is Regex. For example (?:^(?:tbl_|AAA_sp_|sp_)([^_]+)_[^_].*|^(?!tbl_|AAA_sp_|sp_)([^_]+)_[^_]+_.*)
de: Das für die Gruppierung zu verwendende Regex-Muster. Wird nur verwendet, wenn Ordnertyp Regex ist.

# PropertyDescriptionSchemaFolderOptionsLevel2GroupNonMatchingAsOther
source: Group items that do not match the regex into a folder named 'Other'. Only used if Folder Type is Regex.
de: Gruppieren Sie Elemente, die nicht mit dem Regex übereinstimmen, in einem Ordner namens "Andere". Wird nur verwendet, wenn Ordnertyp Regex ist.

# PropertyDescriptionSchemaFolderOptionsQuickSchema
source: Min node count required before using faster but inaccurate method to get schema. Zero = disabled.
de: Mindestknotenzahl erforderlich, bevor eine schnellere, aber ungenaue Methode zum Abrufen des Schemas verwendet werden kann. Null = deaktiviert.

# PropertyDescriptionSchemaFolderOptionsRenameNode
source: Remove the schema name from the object node.
de: Entfernt den Namen des Schemas aus dem Namen des Objektknotens.

# PropertyDescriptionSchemaFolderOptionsUnresponsiveTimeout
source: Milliseconds. Increasing will update faster but be more unresponsive.
de: Millisekunden. Durch Erhöhen erfolgt die Aktualisierung schneller, es erfolgt jedoch eine geringere Reaktionsfähigkeit.

# PropertyDescriptionSchemaFolderOptionsUseClear
source: Min node count required before using faster method but will be unresponsive while updating. Zero = disabled.
de: Für die Verwendung der schnelleren Methode ist eine Mindestknotenanzahl erforderlich, die jedoch während der Aktualisierung nicht reagiert. Null = deaktiviert.

# PropertyDescriptionSchemaFolderOptionsUseObjectIcon
source: Use the icon of the last child node as the folder icon. If false then use the parent node (i.e. folder) icon.
de: Aktiviert das Verwenden des Icons des letzten Elements im Knoten des Schemaordners. Ansonsten wird das Icon des übergeordneten Knotens übernommen.

# PropertyDisplayNameSchemaFolderOptionsAppendDot
source: Append Dot
de: Punkt anhängen

# PropertyDisplayNameSchemaFolderOptionsCloneParentNode
source: Clone Parent Node
de: Elternknoten duplizieren

# PropertyDisplayNameSchemaFolderOptionsEnabled
source: Enabled
de: Aktiviert

# PropertyDisplayNameSchemaFolderOptionsLevel1FolderType
source: Folder Type
de: Ordnertyp

# PropertyDisplayNameSchemaFolderOptionsLevel1MinNodeCount
source: Minimum Node Count
de: Mindestknotenanzahl

# PropertyDisplayNameSchemaFolderOptionsLevel1Regex
source: Regex Pattern
de: Regex-Muster

# PropertyDisplayNameSchemaFolderOptionsLevel1GroupNonMatchingAsOther
source: Group Non-Matching as 'Other'
de: Nicht übereinstimmende als "Andere" gruppieren

# PropertyDisplayNameSchemaFolderOptionsLevel2FolderType
source: Folder Type
de: Ordnertyp

# PropertyDisplayNameSchemaFolderOptionsLevel2MinNodeCount
source: Minimum Node Count
de: Mindestknotenanzahl

# PropertyDisplayNameSchemaFolderOptionsLevel2Regex
source: Regex Pattern
de: Regex-Muster

# PropertyDisplayNameSchemaFolderOptionsLevel2GroupNonMatchingAsOther
source: Group Non-Matching as 'Other'
de: Nicht übereinstimmende als "Andere" gruppieren

# PropertyDisplayNameSchemaFolderOptionsQuickSchema
source: Quick schema from node text
de: Schnelles Schema aus Knotentext

# PropertyDisplayNameSchemaFolderOptionsRenameNode
source: Remove Schema Name From Node
de: Knoten umbenennen

# PropertyDisplayNameSchemaFolderOptionsUnresponsiveTimeout
source: Unresponsive timeout
de: Zeitüberschreitung bei fehlender Reaktion

# PropertyDisplayNameSchemaFolderOptionsUseClear
source: Use Nodes.Clear
de: Verwenden Sie Nodes.Clear

# PropertyDisplayNameSchemaFolderOptionsUseObjectIcon
source: Use Object Icon
de: Icon des Objektes benutzen
